import Layout from '../layouts/Layout';
import Accordion from './AboutUsPage/Accordion';
const data = [
  {
    id: 1,
    title: 'ফেনী জেলার ভাষা ও সংস্কৃতি',
    text: 'ফেনী জেলার ভূ-প্রকৃতি ও ভৌগলিক অবস্থান, বঙ্গোপসাগরের নোনা জল, পীর-ফকিরের প্রভাব এবং পূর্বপুরুষের বীরত্ব গাঁথা এই জেলার মানুষের ভাষা ও সংস্কৃতি গঠনে প্রভূত ভূমিকা রেখেছে',
  },
  {
    id: 2,
    title: 'ফেনী জেলার ভাষা ও সংস্কৃতি',
    text: 'ফেনী জেলার ভূ-প্রকৃতি ও ভৌগলিক অবস্থান, বঙ্গোপসাগরের নোনা জল, পীর-ফকিরের প্রভাব এবং পূর্বপুরুষের বীরত্ব গাঁথা এই জেলার মানুষের ভাষা ও সংস্কৃতি গঠনে প্রভূত ভূমিকা রেখেছে',
  },
  {
    id: 3,
    title: 'ফেনী জেলার ভাষা ও সংস্কৃতি',
    text: 'ফেনী জেলার ভূ-প্রকৃতি ও ভৌগলিক অবস্থান, বঙ্গোপসাগরের নোনা জল, পীর-ফকিরের প্রভাব এবং পূর্বপুরুষের বীরত্ব গাঁথা এই জেলার মানুষের ভাষা ও সংস্কৃতি গঠনে প্রভূত ভূমিকা রেখেছে',
  },
  {
    id: 4,
    title: 'ফেনী জেলার ভাষা ও সংস্কৃতি',
    text: 'ফেনী জেলার ভূ-প্রকৃতি ও ভৌগলিক অবস্থান, বঙ্গোপসাগরের নোনা জল, পীর-ফকিরের প্রভাব এবং পূর্বপুরুষের বীরত্ব গাঁথা এই জেলার মানুষের ভাষা ও সংস্কৃতি গঠনে প্রভূত ভূমিকা রেখেছে',
  },
  {
    id: 5,
    title: 'ফেনী জেলার ভাষা ও সংস্কৃতি',
    text: 'ফেনী জেলার ভূ-প্রকৃতি ও ভৌগলিক অবস্থান, বঙ্গোপসাগরের নোনা জল, পীর-ফকিরের প্রভাব এবং পূর্বপুরুষের বীরত্ব গাঁথা এই জেলার মানুষের ভাষা ও সংস্কৃতি গঠনে প্রভূত ভূমিকা রেখেছে',
  },
];

const AboutUs = () => {
  return (
    <Layout
      title={'About Us'}
      bannerTitle={'About Us'}
      bannerDescription={'About Us Page Description....'}
    >
      <h1 className="text-5xl text-center text-lime-500 font-bold">About Us</h1>
      {data.map((d, i) => (
        <Accordion key={i} id={d.id} title={d.title} text={d.text} />
      ))}
    </Layout>
  );
};

export default AboutUs;
